Revit 2027 API
SpecTypeId.PipingPressure Property
 Pressure, in discipline Piping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PipingPressure { get; }
Public Shared ReadOnly Property PipingPressure As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PipingPressure {
	ForgeTypeId^ get ();
}
static member PipingPressure : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace